{
  "nav": {
    "home": "Home",
    "projects": "Projects"
  },
  "home": {
    "title": "Hi, I'm Hakan.",
    "subtitle": "Software developer, AI enthusiast.",
    "about": {
      "title": "About",
      "content": [
        "Hello, I'm Hakan.",
        "Since childhood, my passion for technology has never faded. Creating new things, coding, and interacting with machines is not just a profession for me; it's a true passion. I have always aimed to make things smarter, better, and more useful.",
        "In the past, I worked on projects in model rocketry, cybersecurity, robotics, and front-end development. I developed Turkey's first thrust-vector-controlled model rocket because I love pushing boundaries and exploring new possibilities. But my ultimate goal has always been to contribute to the technologies of the future.",
        "Currently, I am focusing on iOS development and artificial intelligence. I am developing Dinnermind, a fully AI-powered calorie-tracking application. This is more than just an app—it's part of my journey to explore how AI can be integrated into everyday life.",
        "For me, technology is not just a tool but a force that makes life easier and more efficient. By harnessing the potential of AI, I want to make a meaningful contribution to the future.",
        "And yes, I haven't built an Iron Man suit—yet. But who knows what the future holds, right?"
      ]
    },
    "experience": {
      "title": "Experience",
      "senior": {
        "title": "Software Developer, Founder",
        "company": "Dinnermind",
        "period": "November 2024 - Present",
        "description": "Developing a fully AI-powered calorie tracking application."
      },
      "developer": {
        "title": "Software Developer, Founder",
        "company": "Acidalia Labs - Self Employed",
        "period": "July 2020 - April 2024",
        "description": "Developing cybersecurity and artificial intelligence projects."
      }
    },
    "education": {
      "title": "Education",
      "degree": {
        "title": "Computer Engineering",
        "school": "University Name",
        "period": "2014 - 2018",
        "description": "Education in software development, algorithms and data structures."
      }
    },
    "skills": {
      "title": "Technologies"
    },
    "contact": {
      "title": "Contact",
      "content": "To get in touch with me or learn more about my projects:"
    }
  },
  "projects": {
    "title": "Projects",
    "subtitle": "Some important projects I've developed and technologies I've used.",
    "categories": {
      "web": "Web Application",
      "backend": "Backend Service",
      "mobile": "Mobile App",
      "hardware": "Hardware"
    },
    "items": {
      "gateway": {
        "title": "API Gateway Service",
        "description": "A high-performance API Gateway service. Ideal for microservice architecture with rate limiting, caching, authentication and load balancing features."
      },
      "rocket": {
        "title": "Thrust-Vectored Model Rocket",
        "description": "Turkey's first model rocket with thrust vectoring system."
      },
      "fitness": {
        "title": "Dinnermind",
        "description": "Fully AI-powered and assisted calorie tracking application."
      }
    }
  },
  "footer": {
    "rights": "All rights reserved."
  }
} 