{
  "nav": {
    "home": "Ana Sayfa",
    "projects": "Projeler"
  },
  "home": {
    "title": "Merhaba, ben Hakan.",
    "subtitle": "Yazılım geliştiricisi, yapay zeka tutkunu.",
    "about": {
      "title": "Hakkımda",
      "content": [
        "Merhaba, ben Hakan.",
        "Küçüklüğümden beri teknolojiye olan ilgim hiç azalmadı. Yeni şeyler üretmek, kod yazmak ve makinelerle konuşmak benim için sadece bir meslek değil, aynı zamanda bir tutku. Her zaman bir şeyleri daha iyi, daha akıllı ve daha faydalı hale getirmeye çalıştım.",
        "Geçmişte model roketler, siber güvenlik, robotik ve front-end geliştirme gibi farklı alanlarda projeler ürettim. Türkiye'nin ilk itki yönlendirmeli model roketini yaptım, çünkü sınırları zorlamayı ve yeni şeyler denemeyi seviyorum. Ama asıl hedefim her zaman geleceğin teknolojilerine katkıda bulunmak oldu.",
        "Şu anda iOS geliştirme ve yapay zeka alanlarında yoğun bir şekilde çalışıyorum. Dinnermind adını verdiğim, tamamen yapay zeka destekli bir kalori takip uygulaması geliştiriyorum. Bu sadece bir uygulama değil, yapay zekanın günlük yaşama nasıl entegre edilebileceğini keşfetme yolculuğumun bir parçası.",
        "Teknoloji benim için sadece bir araç değil, insanların hayatını kolaylaştıran ve daha verimli hale getiren bir güç. Yapay zekanın sunduğu potansiyeli en iyi şekilde kullanarak, geleceğe küçük ama anlamlı bir katkı sunmak istiyorum.",
        "Ve evet, henüz Iron Man zırhı yapmadım. Ama kimin ne zaman ne yapacağı belli olmaz, değil mi?"
      ]
    },
    "experience": {
      "title": "Deneyim",
      "senior": {
        "title": "Yazılım Geliştirici, Kurucu",
        "company": "Dinnermind",
        "period": "Kasım 2024 - Günümüz",
        "description": "Tamamen yapay zeka destekli kalori takip uygulaması geliştirme."
      },
      "developer": {
        "title": "Yazılım Geliştirici, Kurucu",
        "company": "Acidalia Labs - Self Employed",
        "period": "Temmuz 2020 - Nisan 2024",
        "description": "Siber güvenlik ve yapay zeka projeleri geliştirme."
      }
    },
    "education": {
      "title": "Eğitim",
      "degree": {
        "title": "Bilgisayar Mühendisliği",
        "school": "Örnek Üniversitesi",
        "period": "2014 - 2018",
        "description": "Bilgisayar bilimleri, yazılım mühendisliği ve web teknolojileri üzerine eğitim."
      }
    },
    "skills": {
      "title": "Yetenekler"
    },
    "contact": {
      "title": "İletişim",
      "content": "Bir proje üzerinde çalışmak veya sadece merhaba demek için benimle iletişime geçebilirsiniz."
    }
  },
  "projects": {
    "title": "Projeler",
    "subtitle": "Geliştirdiğim bazı önemli projeler",
    "categories": {
      "web": "Web Uygulaması",
      "backend": "Backend",
      "mobile": "Mobil Uygulama",
      "hardware": "Donanım"
    },
    "items": {
      "rocket": {
        "title": "İtki Yönlendirmeli Model Roket",
        "description": "Türkiye'nin ilk itki yönlendirme sistemine sahip model roketi."
      },
      "fitness": {
        "title": "Dinnermind",
        "description": "Tamamen yapay zeka destekli ve asistanlı kalori takip uygulaması."
      }
    }
  },
  "footer": {
    "rights": "Tüm hakları saklıdır."
  }
} 